import styles from "../Terms/Terms.module.css";

// קומפוננטה לתנאי השימוש
const Terms = () => {
  return (
    <div>
      <button
        onClick={() => {
          window.history.back();
        }}
        className={styles.backButton}
      >
        חזור
      </button>
      <div className={styles.warrper}>
        <div className={styles.card}>
          <div className={styles.page}>
            <h1 className={styles.title}>תנאי שימוש</h1>
            <p className={styles.subTitle}>
              השימוש באתר החנות הדיגיטלית שלנו מותנה בקבלת תנאי השימוש הבאים.
              אנא קראו אותם בעיון לפני ביצוע רכישות או שימוש באתר.
            </p>

            <h2 className={styles.secendHeader}>1. תוכן האתר</h2>
            <p>
              כל המידע על מוצרים, מחירים, תיאורים ותמונות באתר נועד למטרות מידע
              בלבד ואינו מהווה התחייבות סופית מצד החנות. ייתכנו שינויים במלאי
              ובמחירים ללא הודעה מוקדמת.
            </p>

            <h2 className={styles.secendHeader}>2. אחריות המשתמש</h2>
            <p>
              המשתמש מתחייב לעשות שימוש באתר ובשירותיו באופן חוקי והוגן, לא
              לפרסם תכנים פוגעניים או מטעה, ולא להפר זכויות יוצרים או זכויות
              קניין רוחני של צדדים שלישיים.
            </p>

            <h2 className={styles.secendHeader}>3. הרשמה וחשבון משתמש</h2>
            <p>
              בעת פתיחת חשבון באתר, על המשתמש לספק מידע מדויק ועדכני. המשתמש
              אחראי לשמירת סודיות פרטי ההתחברות שלו ולכל פעילות שתבוצע באמצעות
              החשבון.
            </p>

            <h2 className={styles.secendHeader}>4. פרטיות ואבטחה</h2>
            <p>
              אנו נוקטים באמצעי אבטחה מתקדמים לשמירת המידע האישי ופרטי התשלום
              שלך, אך איננו יכולים להבטיח הגנה מוחלטת על מידע המועבר דרך
              האינטרנט.
            </p>

            <h2 className={styles.secendHeader}>5. שינויים באתר ובתנאים</h2>
            <p>
              החנות שומרת לעצמה את הזכות לשנות את תוכן האתר ואת תנאי השימוש מעת
              לעת. השימוש באתר לאחר שינויים מהווה הסכמה לתנאים המעודכנים.
            </p>

            <h2 className={styles.secendHeader}>6. הגבלת אחריות</h2>
            <p>
              החנות אינה אחראית לנזקים ישירים או עקיפים שייגרמו עקב שימוש באתר,
              עיכובים במשלוח, או הסתמכות על מידע שהוצג באתר.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Terms;
